inaciose/ackerbot_esp32/src/main.cpp
// ###########     ATENTION - ATENTION     ########################
// if give an error about BUFFER_LENGTH on compilation
// on library file MPU6050.cpp, insert the following line
// #define BUFFER_LENGTH 32
// at the top or just before the following line (near 2751)
//int8_t MPU6050::GetCurrentFIFOPacket(uint8_t *data, uint8_t length) { // overflow proof
// ################################################################

#include <Arduino.h>

#include <WiFi.h>
#include <ESPmDNS.h>
#include <WiFiUdp.h>
#include <ArduinoOTA.h>

#include <WiFiManager.h> 

IPAddress ip;

#define LED_BUILTIN 2
#define LED_TIMER_NOT_CONNECTED 250
#define LED_TIMER_CONNECTED 500
int led_time = LED_TIMER_NOT_CONNECTED;

#define BUTTON1_PIN 34
#define BUTTON2_PIN 35
#define BUTTON3_PIN 5
int button1 = false;
int button2 = false;
int button3 = false;

#define ENABLE_OLED       // if use OLED
#define ENABLE_MPU6050    // if use MPU6050
//#define ENABLE_GPS        // if use ENABLE_GPS

#if defined(ENABLE_OLED) || defined(ENABLE_MPU6050)
  #include <Wire.h>
#endif

#ifdef ENABLE_MPU6050
// mpu6050
#define M_PI 3.14159265358979323846
#define __PGMSPACE_H_ 1 // stop compile errors of redefined typedefs and defines with ESP32-Arduino

// I2Cdev and MPU6050 must be installed as libraries, or else the .cpp/.h files
// for both classes must be in the include path of your project
#include "I2Cdev.h"
#include "MPU6050_6Axis_MotionApps20.h"

MPU6050 mpu;

#define OUTPUT_READABLE_YAWPITCHROLL
#define DMP_INTERRUPT_PIN GPIO_NUM_13

// MPU control/status vars
bool dmpReady = false;  // set true if DMP init was successful
uint8_t mpuIntStatus;   // holds actual interrupt status byte from MPU
uint8_t devStatus;      // return status after each device operation (0 = success, !0 = error)
uint16_t packetSize;    // expected DMP packet size (default is 42 bytes)
uint16_t fifoCount;     // count of all bytes currently in FIFO
uint8_t fifoBuffer[64]; // FIFO storage buffer

// orientation/motion vars
Quaternion q;           // [w, x, y, z]         quaternion container
VectorFloat gravity;    // [x, y, z]            gravity vector
float ypr[3];           // [yaw, pitch, roll]   yaw/pitch/roll container and gravity vector

volatile bool mpuInterrupt = false;     // indicates whether MPU interrupt pin has gone high
#endif

#ifdef ENABLE_OLED
  // oled
  #include "SSD1306Wire.h"
  #define OLED_ADDRESS 0x3c
  #define I2C_SDA 14
  #define I2C_SCL 15
  SSD1306Wire display(OLED_ADDRESS, SDA, SCL, GEOMETRY_128_64);
  bool hasDisplay = false; // we probe for the device at runtime
#endif

#ifdef ENABLE_GPS
  #include <TinyGPS++.h>
  #define RXD2 16
  #define TXD2 17
  TinyGPSPlus gps;
  double gps_lat = 0;
  double gps_lng = 0;
#endif

#include "pid.h"

// servo
#include <ESP32Servo.h>
Servo servo1;
int servo1Angle = 90;
int servo1Pin = 15;
int twist_mode = 1;

// bridge-h
int ENA = 27;
int IN1 = 14;
int IN2 = 13;

#define WPWMRANGE 256
#define WPWMFREQ 1000
int motorState = 0;
//int motorSpeed = 0;
signed int leftMotorPwmOut = 0;
//signed int leftMotorPwmOutCmd = 0;

// quadrature encoder
#define ENCODER_LEFT_FUNCTIONA encoderLeftCounterA
#define ENCODER_LEFT_FUNCTIONB encoderLeftCounterB
#define ENCODER_LEFT_PINA 19
#define ENCODER_LEFT_PINB 18
#define ENCODER_LEFT_SIGNAL CHANGE
byte encoderLeftPinLast; // control
volatile signed int encoderLeftPulses; // the number of pulses
boolean encoderLeftDirection; // the rotation direction

long encoderLeftPulsesTarget = 0;
long encoderRightPulsesTarget = 0;
bool encoderLeftPulsesOnTarget = false;
bool encoderRightPulsesOnTarget = false;
bool encoderPulsesTargetEnabled = false;
int encoderLeftPulsesTargetStopOffset = 0;
int encoderRightPulsesTargetStopOffset = 0;

long encoderLeftPulsesTargetStart = 0;
long encoderRightPulsesTargetStart = 0;

// pid
volatile long encoderLeftPulsesSpeedPID; // the number of pulses for PID
volatile long encoderLeftPulsesSteeringPID; // the number of pulses for PID, must be reset at same time

float wheelbase = 0.20; // meters
float wheelradius = 0.033; // meters

// pulses per rotation
int ppr = 2000;
// pulses per meter
int ppm = 0;
// meters per pulse
float mpp = 0;
// meters per wheel rotation
float mpr = 0;

// instantaneous speed
float speed = 0.0;
// speed on second
float speedOs = 0.0;

int speedLastPulses = 0;
int speedOsLastPulses = 0;

// bof:ROS
#include <ros.h>
#include <std_msgs/Int32.h>
#include <std_msgs/String.h>
#include <geometry_msgs/Twist.h>

#include <std_msgs/Int16.h>
//#include <std_msgs/Int16MultiArray.h>
#include <std_msgs/Float32MultiArray.h>

// Set the rosserial socket server IP address
IPAddress masterip;
int serverIp = 64; // 64
// Set the rosserial socket server port
const uint16_t serverPort = 11411;

ros::NodeHandle nh;

// encoder pulses publisher
std_msgs::Int32 encoderLeftPulsesPub;
ros::Publisher encoderPublisher("wheel", &encoderLeftPulsesPub);
#define ENCODER_PUB_TIMER 100

// mcu ip publisher
//std_msgs::String ip_msg;
//ros::Publisher ipPublisher("mcu_ip", &ip_msg);
//#define IP_PUB_TIMER 10000

void encoderPub() {
	static long unsigned int encoderPubTimer = 0;
	if(millis() >= encoderPubTimer) {
		encoderPubTimer = millis() + ENCODER_PUB_TIMER;
		encoderLeftPulsesPub.data = encoderLeftPulses;
		encoderPublisher.publish( &encoderLeftPulsesPub );
	}
}

/*
void ipPub() {
	static long unsigned int ipPubTimer = 0;
	if(millis() >= ipPubTimer) {
		ipPubTimer = millis() + IP_PUB_TIMER;
		ip_msg.data = WiFi.localIP().toString().c_str();
		ipPublisher.publish( &ip_msg );
	}
}
*/

#ifdef ENABLE_GPS
  // gps ip publisher
  //std_msgs::Int16MultiArray gps_data;
  std_msgs::Float32MultiArray gps_data;
  ros::Publisher gpsPublisher("gps_raw", &gps_data);
  #define GPS_PUB_TIMER 100

  void gpsPub() {
    static long unsigned int gpsPubTimer = 0;
    if(millis() >= gpsPubTimer) {
      gpsPubTimer = millis() + GPS_PUB_TIMER;

      /*
      int values[3] = {gps_lat * 100000, gps_lng * 100000, 0};
      gps_data.data = (std_msgs::Int16MultiArray::_data_type *)values;
      gps_data.data_length = 3;
      */

      float values[3] = {(float)gps_lat, (float)gps_lng, 0};
      gps_data.data = (std_msgs::Float32MultiArray::_data_type *)values;
      //gps_data.layout.dim_length = 1;
      gps_data.data_length = 3;

      gpsPublisher.publish( &gps_data );
    }
  }
#endif


float steering_angle = 0;
float velocity_target = 0;

float twist_angular = 0;
float twist_linear = 0;

long unsigned int secondTimer = 0;
long unsigned int loopInfoTimer = 0;

void setPidTarget() {
  int encoderPulsesTarget = 0;

  leftSpeedPidSetPointTmp = -leftSpeedPidSetPointTmp;

