inaciose/ackerbot_esp32/src/main.cpp
	/*
	Serial.print(leftSpeedPidSetPoint);
	Serial.print("\t");
	Serial.print(leftSpeedPidInputLast);
	Serial.println("\n");
	*/
/*
	Serial.print(steering_angle);
	Serial.print("\t");
	Serial.print(velocity_target);
	Serial.print("\t");
	Serial.print(speedOs);
	Serial.print("\t");
	Serial.print(speed);
	Serial.print("\t");
	
	Serial.print(leftSpeedPidSetPoint);
	Serial.print("\t");
	Serial.print(leftSpeedPidInputLast);
	Serial.print("\t");
	
	Serial.print(encoderLeftPulses);
	Serial.print("\t");
	Serial.print(leftMotorPwmOut);
	Serial.print("\t");
	Serial.print(motorState);
	Serial.print("\t");
	Serial.println(servo1Angle);
*/	
  }
}

#ifdef ENABLE_MPU6050
void mpuDMP() {
    static uint32_t timer = millis();

    // if programming failed, don't try to do anything
    if (!dmpReady) return;
    // read a packet from FIFO
    if (mpu.dmpGetCurrentFIFOPacket(fifoBuffer)) { // Get the Latest packet 
        if(millis() > timer) {
            timer = millis()+50;
        #ifdef OUTPUT_READABLE_YAWPITCHROLL
            // display Euler angles in degrees
            mpu.dmpGetQuaternion(&q, fifoBuffer);
            mpu.dmpGetGravity(&gravity, &q);
            mpu.dmpGetYawPitchRoll(ypr, &q, &gravity);
            Serial.print("ypr\t");
            Serial.print(ypr[0] * 180/M_PI);
            Serial.print("\t");
            Serial.print(ypr[1] * 180/M_PI);
            Serial.print("\t");
            Serial.println(ypr[2] * 180/M_PI);
        #endif
        }
    }
}
#endif

void lcdMessage(int cls, int line, String msg) {
  #ifdef ENABLE_OLED
    if(hasDisplay) {
        if(cls) display.clear();
        //display.drawString(128 / 2, 32 / 2, msg);
        display.drawString(0, line * 16, msg);
        display.display();
    }
  #endif
}

void blinkLedBuiltin() {
	static boolean ledstate = 0;
	static long unsigned int ledTimer = 0;
	if(millis() >= ledTimer) {
		ledTimer = millis() + led_time;
		ledstate = !ledstate;
		digitalWrite(LED_BUILTIN, ledstate);
	}
}

// wifi manager report ap callback
void configModeCallback (WiFiManager *myWiFiManager) {
  IPAddress ip;
  Serial.println("Entered config mode");
  ip = WiFi.softAPIP();
  Serial.println(WiFi.softAPIP());
  Serial.println(myWiFiManager->getConfigPortalSSID());

  String slocalip = ip.toString();
  lcdMessage(1, 0, slocalip);
}

void setup() {

  // led config
  pinMode(LED_BUILTIN, OUTPUT);

  // button config
  pinMode(BUTTON1_PIN, INPUT);
  pinMode(BUTTON2_PIN, INPUT);
  pinMode(BUTTON3_PIN, INPUT);

  // serial config
  Serial.begin(115200);
  Serial.println("Booting");

  #ifdef ENABLE_OLED
    hasDisplay = display.init();
    if(hasDisplay) {
        display.flipScreenVertically();
        display.setFont(ArialMT_Plain_16);
        //display.setTextAlignment(TEXT_ALIGN_CENTER);
        display.setTextAlignment(TEXT_ALIGN_LEFT);
        display.setContrast(255);
    }  
    lcdMessage(1, 0, "booting");
  #endif

  #ifdef ENABLE_GPS
    // serial link to GPS
    Serial2.begin(9600, SERIAL_8N1, RXD2, TXD2);
  #endif

	// motor settings	
	pinMode(ENA, OUTPUT);
	pinMode(IN1, OUTPUT);
	pinMode(IN2, OUTPUT);

  // configure PWM channel
  //ledcSetup(pwmChannel, freq, resolution);
	ledcSetup(0, 1000, 8);

	// stop motors
	analogWrite(ENA, 0);
	digitalWrite(IN1, LOW);
	digitalWrite(IN2, LOW);
	motorState = 0;

	// encoder & odometry settings
	// meters per wheel rotation
	mpr = (2 * PI * wheelradius);
	// pulses per meter
	ppm = ppr / mpr;
	// meters per pulse
	mpp = 1.0 / ppm;

	Serial.print("wheelbase: ");
	Serial.println(wheelbase, 3);
	Serial.print("wheelradius: ");
	Serial.println(wheelradius, 3);

	Serial.print("pulses per rotation: ");
	Serial.println(ppr, 6);
	Serial.print("meters per rotation: ");
	Serial.println(mpr, 6);
	Serial.print("meters per pulse: ");
	Serial.println(mpp, 6);
	Serial.print("pulses per meter: ");
	Serial.println(ppm);

	// WiFi manager
	Serial.println("WiFi connecting...");
	WiFiManager wifiManager;
  wifiManager.setAPCallback(configModeCallback);
	wifiManager.setConfigPortalTimeout(300);
	wifiManager.autoConnect("espap");

	while (WiFi.status() != WL_CONNECTED) {
    	Serial.println("Connection Failed! Rebooting...");
    	delay(5000);
    	ESP.restart();
  }

  ip = WiFi.localIP();

  ArduinoOTA
    .onStart([]() {
      String type;
      if (ArduinoOTA.getCommand() == U_FLASH)
        type = "sketch";
      else // U_SPIFFS
        type = "filesystem";

      // NOTE: if updating SPIFFS this would be the place to unmount SPIFFS using SPIFFS.end()
      Serial.println("Start updating " + type);

      #ifdef ENABLE_OLED
        display.clear();
        display.setFont(ArialMT_Plain_10);
        display.setTextAlignment(TEXT_ALIGN_CENTER_BOTH);
        display.drawString(display.getWidth() / 2, display.getHeight() / 2 - 10, "OTA Update");
        display.display();
      #endif
    })
    .onEnd([]() {
      Serial.println("\nEnd");
      #ifdef ENABLE_OLED
        display.clear();
        display.setFont(ArialMT_Plain_10);
        display.setTextAlignment(TEXT_ALIGN_CENTER_BOTH);
        display.drawString(display.getWidth() / 2, display.getHeight() / 2, "OTA done: Restart");
        display.display();
      #endif
    })
    .onProgress([](unsigned int progress, unsigned int total) {
      Serial.printf("Progress: %u%%\r", (progress / (total / 100)));
      #ifdef ENABLE_OLED
        display.drawProgressBar(4, 32, 120, 8, progress / (total / 100) );
        display.display();
      #endif
    })
    .onError([](ota_error_t error) {
      Serial.printf("Error[%u]: ", error);
      if (error == OTA_AUTH_ERROR) Serial.println("Auth Failed");
      else if (error == OTA_BEGIN_ERROR) Serial.println("Begin Failed");
      else if (error == OTA_CONNECT_ERROR) Serial.println("Connect Failed");
      else if (error == OTA_RECEIVE_ERROR) Serial.println("Receive Failed");
      else if (error == OTA_END_ERROR) Serial.println("End Failed");
      #ifdef ENABLE_OLED
        if (error == OTA_AUTH_ERROR) lcdMessage(1, 0, "OTA error: Auth Failed");
        else if (error == OTA_BEGIN_ERROR) lcdMessage(1, 0, "OTA error: Begin Failed");
        else if (error == OTA_CONNECT_ERROR) lcdMessage(1, 0, "OTA error: Connect Failed");
        else if (error == OTA_RECEIVE_ERROR) lcdMessage(1, 0, "OTA error: Receive Failed");
        else if (error == OTA_END_ERROR) lcdMessage(1, 0, "OTA error: End Failed");
        else lcdMessage(1, 0, "OTA error: other");
      #endif

    });

  ArduinoOTA.begin();

  Serial.println("Ready");
  Serial.print("IP address: ");
  Serial.println(ip);

