inaciose/ackerbot_esp32/src/main.cpp
  String slocalip = ip.toString();
  lcdMessage(1, 0, slocalip);

	// try to build the apropriate
	// ros master server ip
	size_t found = slocalip.indexOf(".");
	slocalip = slocalip.substring(found+1);
	found = slocalip.indexOf(".");
	slocalip = slocalip.substring(found+1);
	found = slocalip.indexOf(".");
	slocalip = slocalip.substring(0, found);
	IPAddress server(192,168,slocalip.toInt(),serverIp);
  masterip = server;
	Serial.print("ROS master IP: ");
	Serial.println(masterip);
  lcdMessage(0, 1, masterip.toString());

	// servo
	servo1.attach(servo1Pin);
	servo1.write(90 - 0);
	delay(50);

	// encoders
	encoderLeftDirection = false; 
	pinMode(ENCODER_LEFT_PINA,INPUT);
	pinMode(ENCODER_LEFT_PINB,INPUT);
	attachInterrupt(ENCODER_LEFT_PINA, ENCODER_LEFT_FUNCTIONA, ENCODER_LEFT_SIGNAL);
	attachInterrupt(ENCODER_LEFT_PINB, ENCODER_LEFT_FUNCTIONB, ENCODER_LEFT_SIGNAL);

  #ifdef ENABLE_MPU6050
    // mpu6050
    // initialize device
    Serial.println(F("First MPU6050 initialization ..."));
    mpu.initialize();
    delay(100);

    Serial.println(F("MPU6050 reset..."));
    mpu.reset(); //help startup reliably - doesn't always work though.
    // maybe can also reset i2c on esp32?
    delay(100);

    Serial.println(F("MPU6050 resetI2CMaster..."));
    mpu.resetI2CMaster();
    delay(100);

    // initialize device again
    Serial.println(F("Final MPU6050 initialization..."));
    mpu.initialize();
    
    pinMode(DMP_INTERRUPT_PIN, INPUT);

    // verify connection
    Serial.println(F("Testing device connections..."));
    Serial.println(mpu.testConnection() ? F("MPU6050 connection successful") : F("MPU6050 connection failed"));

    // wait for ready
    //Serial.println(F("\nSend any character to begin DMP programming and demo: "));
    //while (Serial.available() && Serial.read()); // empty buffer
    //while (!Serial.available());                 // wait for data
    //while (Serial.available() && Serial.read()); // empty buffer again
    delay(250);

    // load and configure the DMP
    Serial.println(F("Initializing DMP..."));
    devStatus = mpu.dmpInitialize();

    // supply your own gyro offsets here, scaled for min sensitivity
    mpu.setXGyroOffset(220);
    mpu.setYGyroOffset(76);
    mpu.setZGyroOffset(-85);
    mpu.setZAccelOffset(1788); // 1688 factory default for my test chip

    // make sure it worked (returns 0 if so)
    if (devStatus == 0) {
        // Calibration Time: generate offsets and calibrate our MPU6050
        mpu.CalibrateAccel(6);
        mpu.CalibrateGyro(6);
        mpu.PrintActiveOffsets();
        // turn on the DMP, now that it's ready
        Serial.println(F("Enabling DMP..."));
        mpu.setDMPEnabled(true);

        /*
        // enable Arduino interrupt detection
        Serial.print(F("Enabling interrupt detection (mcu external interrupt "));
        Serial.print(digitalPinToInterrupt(DMP_INTERRUPT_PIN));
        Serial.println(F(")..."));
        attachInterrupt(digitalPinToInterrupt(DMP_INTERRUPT_PIN), dmpDataReady, RISING);
        mpuIntStatus = mpu.getIntStatus();
        // set our DMP Ready flag so the main loop() function knows it's okay to use it
        Serial.println(F("DMP ready! Waiting for first interrupt..."));
        */

        esp_err_t err;

        err = gpio_isr_handler_add(DMP_INTERRUPT_PIN, &dmpDataReady, (void *) 13);
        if (err != ESP_OK) {
            Serial.printf("handler add failed with error 0x%x \r\n", err);
        }

        err = gpio_set_intr_type(DMP_INTERRUPT_PIN, GPIO_INTR_POSEDGE);
        if (err != ESP_OK) {
            Serial.printf("set intr type failed with error 0x%x \r\n", err);
        }

        dmpReady = true;

        // get expected DMP packet size for later comparison
        packetSize = mpu.dmpGetFIFOPacketSize();
        fifoCount = mpu.getFIFOCount();


    } else {
        // ERROR!
        // 1 = initial memory load failed
        // 2 = DMP configuration updates failed
        // (if it's going to break, usually the code will be 1)
        Serial.print(F("DMP Initialization failed (code "));
        Serial.print(devStatus);
        Serial.println(F(")"));
    }
  #endif

	// bof:ROS
	// Set the connection to rosserial socket server
	nh.getHardware()->setConnection(server, serverPort);
	nh.initNode();

	// Another way to get IP
	Serial.print("ROS IP = ");
	Serial.println(nh.getHardware()->getLocalIP());

	nh.subscribe(cmdVelSubscribe);
	nh.advertise(encoderPublisher);
  #ifdef ENABLE_GPS
	  nh.advertise(gpsPublisher);
  #endif
  nh.subscribe(sub_dir);
  nh.subscribe(sub_vel);

	//ipPub();
	// eof:ROS

	// left speed PID
	//leftSpeedPidSetPoint = SPEED_PID_TARGET;
	leftSpeedPidSetPoint = 0;
	//leftSpeedPid.SetMode(AUTOMATIC);
	leftSpeedPid.SetMode(MANUAL);
	leftSpeedPid.SetSampleTime(SPEED_PID_SAMPLE_TIME); 
	leftSpeedPid.SetOutputLimits(LEFT_SPEED_PID_MIN_OUTPUT, LEFT_SPEED_PID_MAX_OUTPUT);
 
}

void loop() {
  ArduinoOTA.handle();

  if(twist_mode) {
    servo1Angle = map(steering_angle*100, -156, 156, 50, 130);  // scale it to use it with the servo (value between 0 and 180)
    
    // steering limits
    if(servo1Angle < 60) servo1Angle = 60;
    if(servo1Angle > 120) servo1Angle = 120;

    if(twist_linear == 0 || twist_linear > 0.02) {
      servo1.write(servo1Angle);
    }
  }

	static double encoderLeftPulsesLast = 999;
	
	if(encoderLeftPulses != encoderLeftPulsesLast) {
		if(encoderLeftPulses != encoderLeftPulsesLast) encoderLeftPulsesLast = encoderLeftPulses;
	}

	// check encoder targets
	if(encoderPulsesTargetEnabled) {
		//
		// check left encoder target
		if(!encoderLeftPulsesOnTarget) {
		if(leftSpeedPidSetPointDirection >= 0) {
			//Serial.print("LP>: "); Serial.println(encoderLeftPulses);
			if(encoderLeftPulses >= encoderLeftPulsesTarget - encoderLeftPulsesTargetStopOffset) {
			encoderLeftPulsesOnTarget = true;  
			}
		} else {
			//Serial.print("LP<: "); Serial.println(encoderLeftPulses);
			if(encoderLeftPulses < encoderLeftPulsesTarget + encoderLeftPulsesTargetStopOffset) {
			encoderLeftPulsesOnTarget = true;
			}      
		}
		// left stop on encoder target
		if(encoderLeftPulsesOnTarget) {
			//Serial.println("L ON TARGET");
			leftMotorPwmOut = 0;
			leftSpeedPidSetPoint = 0;
			leftSpeedPidSetPointDirection = 0; 
		}
		}
		
		//
		// encoders on target
		if(encoderLeftPulsesOnTarget) {
		//Serial.println("BOTH ON TARGET");

